{
  "backend/main.mo": "Defines actor with mixin-based storage and authorization plus data modules for profiles, posts, messages, stories, reels, tracks, and chat messages including timestamp-based sorting helpers.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides short text summaries for numerous frontend files including pages, hooks, layout components, and games.",
  "frontend/ANDROID_APK.md": "Guide explaining prerequisites and steps for building an Android APK using Capacitor.",
  "frontend/android/.gitignore": "Gitignore rules for Android build artifacts, IDE files, logs, and keystore files.",
  "frontend/capacitor.config.ts": "Capacitor configuration defining app metadata, build directory, server options, and Android build settings.",
  "frontend/index.css": "Tailwind base styling with light and dark theme CSS variables and global background/foreground rules.",
  "frontend/index.html": "Main HTML entry with meta tags, icons, manifest, fonts, and root mount node.",
  "frontend/public/downloads/.gitkeep": "Empty placeholder file to preserve the downloads directory.",
  "frontend/public/downloads/caffeine-social.apk": "Bundled Android APK file for app installation.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying app metadata, theme, icons, categories, and start URL.",
  "frontend/src/ai/chatbotRules.ts": "Defines navigation-aware chatbot logic that parses user input and triggers route changes or canned responses.",
  "frontend/src/App.tsx": "Main app entry handling authentication gating, routing setup, theme provider, and layout rendering.",
  "frontend/src/components/ai/AiWritingTool.tsx": "Provides a text transformation UI that applies selectable tone changes and supports copying or downloading results.",
  "frontend/src/components/ai/ImageGenerator.tsx": "Generates abstract images on a canvas using hue and complexity sliders and allows exporting as PNG.",
  "frontend/src/components/ai/LocalChatbot.tsx": "Implements a local chat UI that sends user input to chatbotRespond and displays the conversation thread.",
  "frontend/src/components/layout/AppHeader.tsx": "Renders the app header with logo, user profile info, and logout handling using Internet Identity.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main application layout including header, navigation, main content outlet, and bottom tab bar.",
  "frontend/src/components/layout/AppNavigation.tsx": "Displays the desktop sidebar navigation highlighting the active route using TanStack Router.",
  "frontend/src/components/layout/BottomTabBar.tsx": "Provides the mobile bottom navigation bar with route-aware highlighting.",
  "frontend/src/components/layout/FunctionalButtonBar.tsx": "Shows a horizontal button bar for quick navigation to tools like whiteboard and AI features.",
  "frontend/src/components/posts/PostCard.tsx": "Renders a post with author info, timestamp, content, optional image, and delete functionality for owners.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Provides a modal form for creating or updating a user profile with validation and mutation handling.",
  "frontend/src/components/startup/AppInitGate.tsx": "Controls startup flow by loading actor and user profile, handling timeouts and errors, and showing loading or profile setup states.",
  "frontend/src/components/startup/StartupErrorScreen.tsx": "Displays an error screen with retry logic and optional technical details during app initialization failures.",
  "frontend/src/components/startup/useStartupRetry.ts": "Provides a retry function that invalidates and refetches all React Query queries.",
  "frontend/src/components/study/SlidesTool.tsx": "Implements a simple slide editor and presenter with adding, deleting, reordering, and presentation mode.",
  "frontend/src/components/study/Whiteboard.tsx": "Canvas-based drawing tool with colors, eraser, clear, and PNG export functionality.",
  "frontend/src/docs/nonGoals.md": "Documents features explicitly not implemented, especially screenshot blocking due to browser limitations.",
  "frontend/src/games/2048/Game2048.tsx": "Functional 2048 game including tile movement, merging, scoring, and reset.",
  "frontend/src/games/memory-match/MemoryMatch.tsx": "Emoji-based memory matching game tracking flipped, matched cards, and move count.",
  "frontend/src/games/quiz/Quiz.tsx": "Multiple-choice quiz with scoring, progress tracking, and final results screen.",
  "frontend/src/games/snake/Snake.tsx": "Implements a Snake game with movement, collision, scoring, and keyboard controls using React state and intervals.",
  "frontend/src/games/tic-tac-toe/TicTacToe.tsx": "Provides a basic Tic-Tac-Toe game with winner detection, turn handling, and a reset function.",
  "frontend/src/hooks/queries/useChat.ts": "React Query hooks for fetching messages and sending chat messages through an actor API.",
  "frontend/src/hooks/queries/useCurrentUserProfile.ts": "Hooks to load and save the current user's profile via actor calls with query invalidation.",
  "frontend/src/hooks/queries/useNotificationsRoom.ts": "Hooks for entering notification rooms, fetching entries, adding notifications, and admin actions like ban/unban.",
  "frontend/src/hooks/queries/usePosts.ts": "Hooks to fetch, create, and delete posts with automatic query invalidation.",
  "frontend/src/hooks/queries/usePrivateRooms.ts": "Hooks for creating, entering, and messaging in private chat rooms through actor mutations.",
  "frontend/src/hooks/queries/useReels.ts": "Hooks to fetch, create, and delete video reels using actor API and React Query.",
  "frontend/src/hooks/queries/useStories.ts": "Hooks for loading active stories and creating or deleting stories with query refresh.",
  "frontend/src/hooks/queries/useUserSearch.ts": "Searches usernames via actor API with query enabled only when text is provided.",
  "frontend/src/hooks/queries/useUserTracks.ts": "Hooks for fetching and uploading user audio tracks using identity and actor.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an actor instance tied to user identity, invalidating dependent queries on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, state, and AuthClient setup.",
  "frontend/src/index.css": "Defines Tailwind layers, CSS variables for light and dark themes, and mobile-safe layout adjustments.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, then renders App.",
  "frontend/src/music/library.ts": "Exports a Track interface and a small demo music library with sample audio entries.",
  "frontend/src/pages/AiToolsPage.tsx": "Renders tabbed AI tools page switching between writing, image generation, and chatbot components.",
  "frontend/src/pages/ChatPage.tsx": "Implements messaging UI including direct chat, notifications room, admin tools, and private chat rooms.",
  "frontend/src/pages/FeedPage.tsx": "Displays posts feed and form to create new posts with optional image upload and progress tracking.",
  "frontend/src/pages/GamesPage.tsx": "Provides a tabbed interface to play multiple games including Tic-Tac-Toe, Memory, Snake, 2048, and Quiz.",
  "frontend/src/pages/LoginScreen.tsx": "Shows login screen with Internet Identity sign-in and an option to download the Android APK.",
  "frontend/src/pages/MusicPage.tsx": "Music player page with track filtering, playback controls, and user audio upload with progress tracking.",
  "frontend/src/pages/ReelsPage.tsx": "Page for creating and listing video reels with optional links and owner‑verified deletion.",
  "frontend/src/pages/SearchPage.tsx": "User search interface that fetches matching usernames and allows starting a chat with a selected user.",
  "frontend/src/pages/StoriesPage.tsx": "Story creation and listing page supporting text, optional images, and owner‑verified deletion.",
  "frontend/src/pages/StudyToolsPage.tsx": "Page providing tabbed access to a whiteboard and slide viewer study tools.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and plugins for styling the frontend.",
  "project_state.json": "Defines the project's current requirements, features, issues, and architectural notes for building a mobile-style social app with persistent media and chats."
}