{
  "backend/main.mo": "Motoko canister defining profile, messaging, posts, stories, and reels data types, mixins, and state with access-controlled profile retrieval.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries for major frontend files across pages, components, hooks, and tools.",
  "frontend/index.css": "Tailwind base file defining light/dark theme CSS variables and global styles.",
  "frontend/index.html": "Root HTML document loading fonts, favicon, and bootstrapping the React app.",
  "frontend/src/ai/chatbotRules.ts": "Simple rules-based chatbot that responds to keywords and can navigate to valid routes.",
  "frontend/src/App.tsx": "Main app component handling authentication, profile setup gating, and route definitions for all app sections.",
  "frontend/src/components/ai/AiWritingTool.tsx": "Local text transformation tool allowing tone selection, output preview, copying, and download.",
  "frontend/src/components/ai/ImageGenerator.tsx": "Canvas-based generator creating gradient backgrounds with random circles, adjustable via hue and complexity sliders, with PNG export.",
  "frontend/src/components/ai/LocalChatbot.tsx": "Local chatbot UI that stores messages, processes input through chatbotRules, and can trigger navigation actions.",
  "frontend/src/components/layout/AppHeader.tsx": "Header showing logo and logout button, clearing identity and React Query cache on sign-out.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapping header, navigation sidebar, and routed content area.",
  "frontend/src/components/layout/AppNavigation.tsx": "Sidebar navigation listing app sections with icons and active-state highlighting.",
  "frontend/src/components/posts/PostCard.tsx": "Displays a post's author, timestamp, caption, and optional image using card UI components.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal form for creating a user profile with display name, username, and bio, submitting via mutation.",
  "frontend/src/components/study/SlidesTool.tsx": "Simple slide editor with add, delete, reorder, edit, and presentation mode functionality.",
  "frontend/src/components/study/Whiteboard.tsx": "Canvas-based whiteboard supporting drawing, erasing, clearing, and exporting as PNG.",
  "frontend/src/games/2048/Game2048.tsx": "Implements a playable 2048 game with board initialization, movement/merge logic, scoring, and UI controls.",
  "frontend/src/games/memory-match/MemoryMatch.tsx": "Creates a memory matching game using emoji pairs with flip logic, match detection, move counting, and reset functionality.",
  "frontend/src/games/quiz/Quiz.tsx": "Provides a multi‑question quiz with answer selection, scoring, progress navigation, and result display.",
  "frontend/src/games/snake/Snake.tsx": "Implements a Snake game with movement, food spawning, collision detection, scoring, and keyboard controls.",
  "frontend/src/games/tic-tac-toe/TicTacToe.tsx": "Builds a tic‑tac‑toe game including turn handling, winner detection, and board reset.",
  "frontend/src/hooks/queries/useChat.ts": "Defines hooks to fetch and send chat messages via an actor with react‑query caching and invalidation.",
  "frontend/src/hooks/queries/useCurrentUserProfile.ts": "Provides hooks to load and save the current user profile through the actor with query caching.",
  "frontend/src/hooks/queries/usePosts.ts": "Contains hooks to fetch posts and create new posts using the backend actor and react‑query updates.",
  "frontend/src/hooks/queries/useReels.ts": "Offers hooks for retrieving and creating video reels with automatic query invalidation.",
  "frontend/src/hooks/queries/useStories.ts": "Implements hooks to get active stories and create new ones, syncing via react‑query.",
  "frontend/src/hooks/queries/useUserSearch.ts": "Adds a search hook that queries usernames based on input text through the actor.",
  "frontend/src/hooks/useActor.ts": "Manages creation of the backend actor based on user identity and triggers dependent query invalidation on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity auth, handling login, stored identity loading, and status flags.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/music/library.ts": "Exports a simple music track interface and a small demo track list.",
  "frontend/src/pages/AiToolsPage.tsx": "Renders a tabbed UI for AI tools including writing, image generation, and a chatbot.",
  "frontend/src/pages/ChatPage.tsx": "Implements a chat interface allowing users to send and view messages with a selected principal ID.",
  "frontend/src/pages/FeedPage.tsx": "Displays a feed of posts and provides a form to create posts with optional image uploads and progress tracking.",
  "frontend/src/pages/GamesPage.tsx": "Provides a tabbed interface to play various built-in games like Tic-Tac-Toe, Memory, Snake, 2048, and Quiz.",
  "frontend/src/pages/LoginScreen.tsx": "Renders a login screen prompting users to sign in using Internet Identity.",
  "frontend/src/pages/MusicPage.tsx": "Music library page with filtering, audio playback controls, and track navigation logic.",
  "frontend/src/pages/ReelsPage.tsx": "Reels page enabling reel creation via form inputs and displaying existing reels with loading states.",
  "frontend/src/pages/SearchPage.tsx": "User search page that queries usernames and allows starting a chat with selected results.",
  "frontend/src/pages/StoriesPage.tsx": "Stories page supporting text/image story creation and rendering active stories with timestamps.",
  "frontend/src/pages/StudyToolsPage.tsx": "Study tools page providing tabbed access to a whiteboard and slides components.",
  "frontend/src/utils/urlParams.ts": "Utility functions for retrieving, storing, and clearing URL and session parameters with hash support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color variables, animations, and plugins.",
  "project_state.json": "Describes the social app's overall state, requirements, features, and image assets needed for development. Includes authentication, feed, chat, stories, reels, and auxiliary tool requirements plus architectural notes."
}