{
  "backend/main.mo": "Actor module defining user profiles, posts, messages, stories, and reels with timestamp-based sorting and access-controlled queries using mixin storage and authorization.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related files, components, and test identifiers for project tracking.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all major frontend files including pages, hooks, components, and games.",
  "frontend/ANDROID_APK.md": "Guide explaining prerequisites and steps for building the Android APK using Capacitor and Android Studio.",
  "frontend/android/.gitignore": "Gitignore file specifying Android build outputs and IDE artifacts to exclude from version control.",
  "frontend/capacitor.config.ts": "Capacitor configuration defining app metadata, web directory, Android build options, and development server settings.",
  "frontend/index.css": "Tailwind CSS setup defining global themes, variables, dark mode styles, and base element styling.",
  "frontend/index.html": "App HTML entry point setting metadata, icons, fonts, and loading the root React script.",
  "frontend/public/downloads/.gitkeep": "Empty placeholder file ensuring the downloads directory remains in version control.",
  "frontend/public/downloads/caffeine-social.apk": "Bundled Android APK file served as a static download asset.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, colors, icons, start URL, and display behavior.",
  "frontend/src/ai/chatbotRules.ts": "Implements simple keyword-based chatbot responses and triggers route navigation via a provided navigate function.",
  "frontend/src/App.tsx": "Main React entry defining routing, authentication flow, and initialization gating for rendering the app or login screen.",
  "frontend/src/components/ai/AiWritingTool.tsx": "Provides a text transformer with selectable tones and options to copy or download the generated output.",
  "frontend/src/components/ai/ImageGenerator.tsx": "Generates abstract images on a canvas using hue and complexity sliders and allows exporting the result as PNG.",
  "frontend/src/components/ai/LocalChatbot.tsx": "Implements a local UI chatbot that displays message history and uses chatbotRules to navigate or reply to user input.",
  "frontend/src/components/layout/AppHeader.tsx": "Renders the app header with branding and a logout button tied to Internet Identity and React Query clearing.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main layout structure including header, sidebar navigation, content outlet, and bottom tab bar.",
  "frontend/src/components/layout/AppNavigation.tsx": "Desktop sidebar navigation listing all major routes with icons and active-state styling.",
  "frontend/src/components/layout/BottomTabBar.tsx": "Mobile bottom navigation bar showing route icons and labels with active highlighting.",
  "frontend/src/components/posts/PostCard.tsx": "Displays a post with author info, timestamp, caption, and optional image using UI card components.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal form for creating a user profile with display name, username, and optional bio, submitting via mutation.",
  "frontend/src/components/startup/AppInitGate.tsx": "Manages app initialization by checking actor and profile state, handling timeouts or errors, and showing setup or children accordingly.",
  "frontend/src/components/startup/StartupErrorScreen.tsx": "Displays an app startup error with retry handling and optional technical details.",
  "frontend/src/components/startup/useStartupRetry.ts": "Provides a retry function that invalidates and refetches all React Query queries.",
  "frontend/src/components/study/SlidesTool.tsx": "Implements a simple slide editor with slide creation, reordering, deletion, and presentation mode.",
  "frontend/src/components/study/Whiteboard.tsx": "Interactive canvas whiteboard with drawing, erasing, color selection, clearing, and PNG export.",
  "frontend/src/games/2048/Game2048.tsx": "Playable 2048 game with tile movement, scoring, board rendering, and reset support.",
  "frontend/src/games/memory-match/MemoryMatch.tsx": "Memory matching game using emoji pairs with move tracking and win detection.",
  "frontend/src/games/quiz/Quiz.tsx": "Multiple‑choice quiz component with scoring, question progression, and a results screen.",
  "frontend/src/games/snake/Snake.tsx": "Implements a playable Snake game with movement, collision detection, scoring, and keyboard controls.",
  "frontend/src/games/tic-tac-toe/TicTacToe.tsx": "Provides a Tic-Tac-Toe game with turn logic, winner detection, and board reset functionality.",
  "frontend/src/hooks/queries/useChat.ts": "React Query hooks for fetching and sending chat messages through the backend actor.",
  "frontend/src/hooks/queries/useCurrentUserProfile.ts": "Hooks to retrieve and update the current user's profile using the backend actor.",
  "frontend/src/hooks/queries/usePosts.ts": "React Query hooks for loading posts and creating new posts via the backend.",
  "frontend/src/hooks/queries/useReels.ts": "Hooks to fetch and create reels using backend actor methods.",
  "frontend/src/hooks/queries/useStories.ts": "Hooks for retrieving active stories and creating new stories through the backend.",
  "frontend/src/hooks/queries/useUserSearch.ts": "Searches usernames with a backend call triggered by non-empty input.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to the user's identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication logic, including login, logout, and identity loading.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables with light/dark themes and mobile layout adjustments.",
  "frontend/src/main.tsx": "Initializes React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/music/library.ts": "Defines a simple track interface and exports a small demo music library.",
  "frontend/src/pages/AiToolsPage.tsx": "Renders an AI tools page with tabs for writing, image generation, and a local chatbot.",
  "frontend/src/pages/ChatPage.tsx": "Chat interface allowing users to select a recipient, view messages, and send new messages using Internet Identity authentication.",
  "frontend/src/pages/FeedPage.tsx": "Displays posts and provides a form to create new posts with captions and optional image uploads including progress tracking.",
  "frontend/src/pages/GamesPage.tsx": "Presents a tabbed interface for playing multiple built-in games like Tic-Tac-Toe, Memory Match, Snake, 2048, and Quiz.",
  "frontend/src/pages/LoginScreen.tsx": "Login screen using Internet Identity with an option to download the Android APK and a feature overview.",
  "frontend/src/pages/MusicPage.tsx": "Music player with filtering, track selection, playback controls, and progress seeking using an audio element.",
  "frontend/src/pages/ReelsPage.tsx": "Allows users to create reels with title and optional link and displays a list of existing reels with timestamps.",
  "frontend/src/pages/SearchPage.tsx": "User search page that queries usernames as text is typed and allows starting a chat with a selected user.",
  "frontend/src/pages/StoriesPage.tsx": "Displays active stories and provides a form for creating a new story with text and an optional image.",
  "frontend/src/pages/StudyToolsPage.tsx": "Renders study tools with tabbed navigation between a whiteboard and a slides tool.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for getting, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, typography, animations, and plugin setup.",
  "project_state.json": "Project metadata describing app goals, architecture notes, known issues, and implemented features."
}