{
  "kind": "build_request",
  "title": "Fix app not loading and provide Android APK download link",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-22",
      "text": "Investigate and fix the 'app is not loading' issue so the deployed web app reliably renders the login screen for logged-out users and the main app layout for logged-in users, without getting stuck on an infinite loading spinner or a blank screen.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The app is not loading fixed of problem"
        ]
      },
      "acceptanceCriteria": [
        "Opening the deployed web app on a fresh browser session shows the Login screen within 5 seconds (no blank screen).",
        "After signing in with Internet Identity, the app navigates into the authenticated experience and renders content (e.g., Feed) without being stuck on 'Loading...'.",
        "If backend/actor initialization fails for any reason, the UI shows an English error state with a retry action instead of spinning indefinitely.",
        "No uncaught exceptions appear in the browser console during initial load, login, and first navigation."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Harden frontend startup and actor initialization so that access-control/initialization calls do not block app rendering when optional secrets are missing, and failures are handled gracefully with an actionable English error message.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The app is not loading fixed of problem"
        ]
      },
      "acceptanceCriteria": [
        "When no admin token/secret is present, the app still loads and authentication flows work (no initialization-related crash or infinite spinner).",
        "When initialization fails (simulated by forcing an error), the app shows an English error UI with a retry button that re-attempts initialization.",
        "The login screen remains accessible even if anonymous actor creation/initialization fails (i.e., the user is not blocked from seeing the login UI)."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Produce an Android APK build artifact from this repository using the existing Capacitor Android setup, and include it in the deliverables in a clearly documented location in the repo.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "give it to me apk file"
        ]
      },
      "acceptanceCriteria": [
        "A successfully built APK (debug or release) is generated via documented steps in this repo and can be installed on an Android device/emulator.",
        "The repo documentation clearly states the exact output path(s) where the generated APK can be found after the build completes.",
        "The Android build uses the existing Capacitor configuration and builds the current web app version (no missing assets / white screen on launch)."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Add a stable in-app download link for the Android APK by serving the APK as a static file from the frontend and exposing an English-labeled 'Download Android APK' link from an appropriate screen (e.g., Login screen and/or a simple About/Info section).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "and download link"
        ]
      },
      "acceptanceCriteria": [
        "The APK file is placed under a static public path (e.g., within frontend/public) so it is downloadable from the deployed web site.",
        "The UI displays an English 'Download Android APK' link that downloads the APK when clicked.",
        "The download link remains visible/accessible even if the user is not logged in."
      ]
    },
    {
      "id": "REQ-26",
      "text": "Update/extend the existing Android APK documentation to include: prerequisites, exact build commands, how to copy/place the built APK into the static public download path used by the app, and how to verify the APK opens without a white screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "give it to me apk file and download link"
        ]
      },
      "acceptanceCriteria": [
        "Documentation provides step-by-step commands to build the web app, sync Capacitor, and build the Android APK.",
        "Documentation explains how to publish the APK for web download (static file placement + resulting URL).",
        "Documentation includes a verification checklist for both web load and Android app load (ensuring the app is not stuck loading)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if an upgrade requires conditional state migration.",
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything in frontend/src/components/ui; compose or add new code around them instead.",
    "All user-facing UI text must be in English."
  ],
  "nonGoals": [
    "Adding new social features beyond fixing loading, packaging, and providing an APK download link.",
    "Integrating third-party hosting services for the APK download link (the link must be served from the app’s own static assets).",
    "Adding non-Internet-Identity authentication providers."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}