{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix startup loading issues and add Android APK download link",
  "requirements": [
    {
      "id": "REQ-22",
      "summary": "Fix initial render so logged-out users always see Login quickly, logged-in users reliably reach the authenticated layout, and failures show an actionable error instead of infinite loading/blank screen.",
      "acceptanceCriteria": [
        "Opening the deployed web app on a fresh browser session shows the Login screen within 5 seconds (no blank screen).",
        "After signing in with Internet Identity, the app navigates into the authenticated experience and renders content (e.g., Feed) without being stuck on 'Loading...'.",
        "If backend/actor initialization fails for any reason, the UI shows an English error state with a retry action instead of spinning indefinitely.",
        "No uncaught exceptions appear in the browser console during initial load, login, and first navigation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Refactor RootComponent gating so the LoginScreen renders immediately for logged-out users, and authenticated rendering (AppLayout/ProfileSetupModal) is guarded by a dedicated initialization state that can surface an English error UI + retry instead of an infinite spinner/blank screen."
        },
        {
          "path": "frontend/src/components/startup/AppInitGate.tsx",
          "operation": "create",
          "description": "Create an app initialization gate component that coordinates actor readiness and profile loading, prevents rendering authenticated routes until dependencies are ready, and exposes a retry action that re-attempts initialization via React Query invalidation (no direct edits to forbidden hooks)."
        },
        {
          "path": "frontend/src/components/startup/StartupErrorScreen.tsx",
          "operation": "create",
          "description": "Create a simple English error-state component (title, short description, optional technical details in a collapsible area, and a Retry button) used when actor/profile initialization fails (avoid any dependency on forbidden hook edits)."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Harden frontend startup so missing optional secrets do not block rendering, and initialization failures are handled gracefully with an English error and retry while keeping Login accessible.",
      "acceptanceCriteria": [
        "When no admin token/secret is present, the app still loads and authentication flows work (no initialization-related crash or infinite spinner).",
        "When initialization fails (simulated by forcing an error), the app shows an English error UI with a retry button that re-attempts initialization.",
        "The login screen remains accessible even if anonymous actor creation/initialization fails (i.e., the user is not blocked from seeing the login UI)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/startup/useStartupRetry.ts",
          "operation": "create",
          "description": "Add a small hook that provides a stable retry callback to re-attempt startup by invalidating/refetching React Query caches related to actor/profile queries (without modifying frontend/src/hooks/useActor.ts or other forbidden hook files)."
        },
        {
          "path": "frontend/src/pages/LoginScreen.tsx",
          "operation": "modify",
          "description": "Ensure the login screen remains fully usable regardless of background initialization status by rendering any startup error messaging non-blockingly (English text only) and keeping the Internet Identity sign-in button accessible. Verify the component's usage instructions before implementing (shadcn-ui Button/Card usage)."
        },
        {
          "path": "frontend/src/utils/urlParams.ts",
          "operation": "modify",
          "description": "Add non-breaking utilities to support startup hardening (e.g., a safe helper for checking presence of optional secrets and/or a documented, explicit 'optional secret' getter) so higher-level code can avoid treating missing secrets as fatal; do not change existing exported behavior in a way that would break current routes."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Document how to produce an Android APK using the existing Capacitor Android setup, and store the generated artifact in a clearly documented repo location.",
      "acceptanceCriteria": [
        "A successfully built APK (debug or release) is generated via documented steps in this repo and can be installed on an Android device/emulator.",
        "The repo documentation clearly states the exact output path(s) where the generated APK can be found after the build completes.",
        "The Android build uses the existing Capacitor configuration and builds the current web app version (no missing assets / white screen on launch)."
      ],
      "file_operations": [
        {
          "path": "frontend/ANDROID_APK.md",
          "operation": "modify",
          "description": "Extend the existing Capacitor Android build guide to clearly specify: (1) the exact Gradle output paths for debug/release APKs, (2) the repo location to place the final downloadable APK (static public path), and (3) a quick verification checklist to avoid Android 'white screen' (correct webDir build, capacitor sync, and asset presence)."
        },
        {
          "path": "frontend/public/downloads/.gitkeep",
          "operation": "create",
          "description": "Add a tracked downloads directory placeholder under the static public path to establish the documented location for publishing the built APK for web download."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Serve the Android APK as a static frontend asset and expose an English-labeled 'Download Android APK' link from a screen accessible when logged out.",
      "acceptanceCriteria": [
        "The APK file is placed under a static public path (e.g., within frontend/public) so it is downloadable from the deployed web site.",
        "The UI displays an English 'Download Android APK' link that downloads the APK when clicked.",
        "The download link remains visible/accessible even if the user is not logged in."
      ],
      "file_operations": [
        {
          "path": "frontend/public/downloads/caffeine-social.apk",
          "operation": "create",
          "description": "Add the generated Android APK artifact to a stable static public location so it can be downloaded from the deployed site (this file should be produced by the documented build steps and placed here for release)."
        },
        {
          "path": "frontend/src/pages/LoginScreen.tsx",
          "operation": "modify",
          "description": "Add an English 'Download Android APK' link/button on the Login screen that points to the static public APK path and triggers a direct download; keep it visible for logged-out users. Verify the component's usage instructions before implementing (shadcn-ui Button/Card usage)."
        },
        {
          "path": "frontend/src/components/layout/AppHeader.tsx",
          "operation": "modify",
          "description": "Optionally add a lightweight, always-English 'Download Android APK' link in the header area that is visible when logged out is not applicable here; ensure it does not introduce new routes and does not interfere with existing logout behavior. Verify the component's usage instructions before implementing (shadcn-ui Button usage if used)."
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Update Android APK documentation with prerequisites, exact build commands, how to publish the APK to the static download path, and verification steps for both web and Android startup.",
      "acceptanceCriteria": [
        "Documentation provides step-by-step commands to build the web app, sync Capacitor, and build the Android APK.",
        "Documentation explains how to publish the APK for web download (static file placement + resulting URL).",
        "Documentation includes a verification checklist for both web load and Android app load (ensuring the app is not stuck loading)."
      ],
      "file_operations": [
        {
          "path": "frontend/ANDROID_APK.md",
          "operation": "modify",
          "description": "Add explicit commands for: install deps, web build to match Capacitor webDir, Capacitor sync, Android build, plus exact copy/move instructions to place the produced APK into frontend/public/downloads/caffeine-social.apk and a checklist to verify no white screen (Android) and no infinite spinner/blank screen (web)."
        },
        {
          "path": "frontend/capacitor.config.ts",
          "operation": "modify",
          "description": "Align documentation and configuration assumptions by verifying the configured webDir matches the build output used by the documented commands, and update config comments if needed to reduce the risk of Android loading a stale/missing dist directory."
        }
      ]
    }
  ]
}